import re

# \d 匹配一个数字字符。等价于[0-9]
ret = re.match(r"速度与激情\d","速度与激情2")

# [1-8]匹配数字1-8，遇9则报错
ret = re.match(r"速度与激情[1-8]","速度与激情8")

# [2356]只匹配这几个数字，遇到其他就报错
ret = re.match(r"速度与激情[2356]","速度与激情8")

# 只匹配123678，遇到45就报错
ret = re.match(r"速度与激情[1-36-8]","速度与激情6")

# 只匹配1-8和abcd，其他报错
ret = re.match(r"速度与激情[1-8abcd]","速度与激情e")
ret = re.match(r"速度与激情[1-8a-d]","速度与激情e")

# 只匹配1-8和A-Z，其他报错
ret = re.match(r"速度与激情[1-8A-Z]","速度与激情a")

# \w 英文大小写A-Z,a-z,数字0-9和_  其他则报错，注意：因使用Unicode字符集，输入的中文的也可以匹配成功的
ret = re.match(r"速度与激情\w","速度与激情=")

# 要求在数字之前输入一个空格
ret = re.match(r"速度与激情 \d","速度与激情 2")

# \s 匹配一个空格和tab键
ret = re.match(r"速度与激情\s\d","速度与激情 2")

# . 匹配任意一个字符
ret = re.match(r"速度与激情.","速度与激情&")


print(ret.group())